Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM706.h
#define CM4FLTR CM4FLTR
extern volatile unsigned int  CM4FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM4FLTRBITS {
  union {
    struct {
      unsigned CFDIV:3;
      unsigned CFLTREN:1;
      unsigned CFSEL:3;
    };
    struct {
      unsigned CFDIV0:1;
      unsigned CFDIV1:1;
      unsigned CFDIV2:1;
      unsigned :1;
      unsigned CFSEL0:1;
      unsigned CFSEL1:1;
      unsigned CFSEL2:1;
    };
  };
} CM4FLTRBITS;
extern volatile CM4FLTRBITS CM4FLTRbits __attribute__((__sfr__));

#define CM5CON CM5CON
extern volatile unsigned int  CM5CON __attribute__((__sfr__));
__extension__ typedef struct tagCM5CONBITS {
  union {
    struct {
      unsigned CCH:2;
      unsigned :2;
      unsigned CREF:1;
      unsigned :1;
      unsigned EVPOL:2;
      unsigned COUT:1;
      unsigned CEVT:1;
      unsigned OPMODE:1;
      unsigned :2;
      unsigned CPOL:1;
      unsigned COE:1;
      unsigned CON:1;
    };
    struct {
      unsigned CCH0:1;
      unsigned CCH1:1;
      unsigned :4;
      unsigned EVPOL0:1;
      unsigned EVPOL1:1;
      unsigned :7;
      unsigned CEN:1;
    };
  };
} CM5CONBITS;
extern volatile CM5CONBITS CM5CONbits __attribute__((__sfr__));

#define CM5MSKSRC CM5MSKSRC
extern volatile unsigned int  CM5MSKSRC __attribute__((__sfr__));
__extension__ typedef struct tagCM5MSKSRCBITS {
  union {
    struct {
      unsigned SELSRCA:4;
      unsigned SELSRCB:4;
      unsigned SELSRCC:4;
    };
    struct {
      unsigned SELSRCA0:1;
      unsigned SELSRCA1:1;
      unsigned SELSRCA2:1;
      unsigned SELSRCA3:1;
      unsigned SELSRCB0:1;
      unsigned SELSRCB1:1;
      unsigned SELSRCB2:1;
      unsigned SELSRCB3:1;
      unsigned SELSRCC0:1;
      unsigned SELSRCC1:1;
      unsigned SELSRCC2:1;
      unsigned SELSRCC3:1;
    };
  };
} CM5MSKSRCBITS;
extern volatile CM5MSKSRCBITS CM5MSKSRCbits __attribute__((__sfr__));

#define CM5MSKCON CM5MSKCON
extern volatile unsigned int  CM5MSKCON __attribute__((__sfr__));
typedef struct tagCM5MSKCONBITS {
  unsigned AANEN:1;
  unsigned AAEN:1;
  unsigned ABNEN:1;
  unsigned ABEN:1;
  unsigned ACNEN:1;
  unsigned ACEN:1;
  unsigned PAGS:1;
  unsigned NAGS:1;
  unsigned OANEN:1;
  unsigned OAEN:1;
  unsigned OBNEN:1;
  unsigned OBEN:1;
  unsigned OCNEN:1;
  unsigned OCEN:1;
  unsigned :1;
  unsigned HLMS:1;
} CM5MSKCONBITS;
extern volatile CM5MSKCONBITS CM5MSKCONbits __attribute__((__sfr__));

#define CM5FLTR CM5FLTR
extern volatile unsigned int  CM5FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM5FLTRBITS {
  union {
    struct {
      unsigned CFDIV:3;
      unsigned CFLTREN:1;
      unsigned CFSEL:3;
    };
    struct {
      unsigned CFDIV0:1;
      unsigned CFDIV1:1;
      unsigned CFDIV2:1;
      unsigned :1;
      unsigned CFSEL0:1;
      unsigned CFSEL1:1;
      unsigned CFSEL2:1;
    };
  };
} CM5FLTRBITS;
extern volatile CM5FLTRBITS CM5FLTRbits __attribute__((__sfr__));

#define CVR2CON CVR2CON
extern volatile unsigned int  CVR2CON __attribute__((__sfr__));
typedef struct tagCVR2CONBITS {
  unsigned CVR:4;
  unsigned CVRSS:1;
  unsigned CVRR0:1;
  unsigned CVROE:1;
  unsigned CVREN:1;
  unsigned :2;
  unsigned VREFSEL:1;
  unsigned CVRR1:1;
} CVR2CONBITS;
extern volatile CVR2CONBITS CVR2CONbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile unsigned int  PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  unsigned PTGITM:2;
  unsigned :4;
  unsigned PTGWTO:1;
  unsigned PTGSTRT:1;
  unsigned PTGIVIS:1;
  unsigned PTGSSEN:1;
  unsigned PTGSWT:1;
  unsigned :1;
  unsigned PTGTOGL:1;
  unsigned PTGSIDL:1;
  unsigned :1;
  unsigned PTGEN:1;
} PTGCSTBITS;
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile unsigned int  PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  unsigned PTGWDT:3;
  unsigned :1;
  unsigned PTGPWD:4;
  unsigned PTGDIV:5;
  unsigned PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile unsigned int  PTGBTE __attribute__((__sfr__));
__extension__ typedef struct tagPTGBTEBITS {
  union {
    struct {
      unsigned OC1TSS:1;
      unsigned OC2TSS:1;
      unsigned OC3TSS:1;
      unsigned OC4TSS:1;
      unsigned OC1CS:1;
      unsigned OC2CS:1;
      unsigned OC3CS:1;
      unsigned OC4CS:1;
      unsigned IC1TSS:1;
      unsigned IC2TSS:1;
      unsigned IC3TSS:1;
      unsigned IC4TSS:1;
      unsigned ADCTS1:1;
      unsigned ADCTS2:1;
      unsigned ADCTS3:1;
      unsigned ADCTS4:1;
    };
    struct {
      unsigned PTGBTE:16;
    };
  };
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile unsigned int  PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile unsigned int  PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile unsigned int  PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile unsigned int  PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile unsigned int  PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile unsigned int  PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile unsigned int  PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile unsigned int  PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile unsigned int  PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  unsigned PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile unsigned int  PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  unsigned STEP0:8;
  unsigned STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile unsigned int  PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  unsigned STEP2:8;
  unsigned STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile unsigned int  PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  unsigned STEP4:8;
  unsigned STEP5:8;
} PTGQUE2BITS;
